Revit 2027 API
BuiltInFailures.ViewFailures.InsertColumnViewFailure Property
 Column cannot be placed in Elevation or Section view
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InsertColumnViewFailure { get; }
Public Shared ReadOnly Property InsertColumnViewFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InsertColumnViewFailure {
	FailureDefinitionId^ get ();
}
static member InsertColumnViewFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace